In [1]:
#Load necessary libraries
import pandas as pd
from sqlalchemy import create_engine
import csv
from datetime import datetime, timedelta
import random
import numpy as np

In [2]:
#Load Data
employee_data = pd.read_csv('employee_data.csv')
expense_data = pd.read_csv('expense_data.csv')
items_data = pd.read_csv('items_data.csv')
location_data = pd.read_csv('location_data.csv')

In [3]:
print(employee_data.head())

   EMPLOYEE_ID FIRST_NAME  LAST_NAME     EMAIL  PHONE_NUMBER  HIRE_DATE  \
0          198     Donald   OConnell  DOCONNEL  650.507.9833  21-JUN-07
1          199    Douglas      Grant    DGRANT  650.507.9844  13-JAN-08
2          200   Jennifer     Whalen   JWHALEN  515.123.4444  17-SEP-03
3          201    Michael  Hartstein  MHARTSTE  515.123.5555  17-FEB-04
4          202        Pat        Fay      PFAY  603.123.6666  17-AUG-05

     JOB_ID  SALARY COMMISSION_PCT MANAGER_ID  DEPARTMENT_ID
0  SH_CLERK    2600             -         124             50
1  SH_CLERK    2600             -         124             50
2   AD_ASST    4400             -         101             10
3    MK_MAN   13000             -         100             20
4    MK_REP    6000             -         201             20

In [4]:
print(expense_data.head())

             Date               Account        Category  Subcategory  \
0  3/2/2022 10:11  CUB - online payment            Food          NaN
1  3/2/2022 10:11  CUB - online payment           Other          NaN
2  3/1/2022 19:50  CUB - online payment            Food          NaN
3  3/1/2022 18:56  CUB - online payment  Transportation          NaN
4  3/1/2022 18:22  CUB - online payment            Food          NaN

               Note    INR Income/Expense  Note.1  Amount Currency  Account.1
0           Brownie   50.0        Expense     NaN    50.0      INR       50.0
1  To lended people  300.0        Expense     NaN   300.0      INR      300.0
2            Dinner   78.0        Expense     NaN    78.0      INR       78.0
3             Metro   30.0        Expense     NaN    30.0      INR       30.0
4            Snacks   67.0        Expense     NaN    67.0      INR       67.0

In [5]:
print(items_data.head())

   Unnamed: 0             company                            product  regular  \
0           0       CASA FORCELLO        Strawberry Balsamic Compote     9.99
1           1  Whole Foods Market  Organic Dark Roast Steeped Coffee    11.99
2           2              Brekki    Vanilla Cinnamon Overnight Oats     2.99
3           3              Brekki            Original Overnight Oats     2.99
4           4          MAD HIPPIE             Antioxidant Facial Oil    25.99

    sale  prime           category  sale_discount  prime_discount  \
0   4.99   4.49  pantry_essentials          0.501           0.551
1   5.99   5.39          Beverages          0.500           0.550
2   1.50   1.35  pantry_essentials          0.498           0.548
3   1.50   1.35  pantry_essentials          0.498           0.548
4  14.49  13.04             beauty          0.442           0.498

   prime_sale_difference discount_bins parsed_product
0                  0.050   50% or more        Compote
1                  0.050   50% or more         Coffee
2                  0.050   50% or more           Oats
3                  0.050   50% or more           Oats
4                  0.056    40% to 50%            Oil

In [6]:
print(location_data.head())

                 Store Name           Street Address  Address Borough  \
0        Rivas Deli Grocery    651 East 183rd Street      NaN   Bronx
1                    C-Town  1761 Southern Boulevard      NaN   Bronx
2      La India Mini Market      1942 Marmion Avenue      NaN   Bronx
3              Los Hermanos         2019 Vyse Avenue      NaN   Bronx
4  Price Choice Food Market    820 East 180th Street      NaN   Bronx

   Zip Code  Year Awarded  Program Wave   Latitude  Longitude  \
0     10458          2013             1  40.852568 -73.887484
1     10460          2013             1  40.837267 -73.888016
2     10460          2013             1  40.842942 -73.887136
3     10460          2013             1  40.842391 -73.881835
4     10460          2013             1  40.846173 -73.884871

   Community Board  Council District        BIN           BBL  \
0            206.0              15.0  2012464.0  2.030870e+09
1            203.0              15.0  2009878.0  2.029400e+09
2            206.0              15.0  2010156.0  2.029600e+09
3            206.0              15.0  2013203.0  2.031270e+09
4            206.0              15.0  2012955.0  2.031080e+09

   Census Tract (2020) Neighborhood Tabulation Area (NTA) (2020)
0                391.0                                    BX0603
1                155.0                                    BX0303
2              36502.0                                    BX0602
3                363.0                                    BX0601
4              36501.0                                    BX0602

In [7]:
# Pass the connection string to a variable, conn_url
conn_url = 'postgresql://postgres:123@localhost:5432/ABCFOODMART'

# Create an engine that connects to PostgreSQL server
engine = create_engine(conn_url)

# Establish a connection
connection = engine.connect()


#SQL statements to create all tables in the schema
sql_statement = """

    CREATE TABLE aisles (
        aisle_id INTEGER,
        aisle_name VARCHAR(50) NOT NULL,
        PRIMARY KEY (aisle_id));

    CREATE TABLE locations (
        location_id INTEGER,
        location_address VARCHAR(100) NOT NULL,
        location_city VARCHAR(50) NOT NULL,
        location_borough VARCHAR(50) NOT NULL,
        location_state CHAR(30) NOT NULL,
        location_zip_code CHAR(5),
        PRIMARY KEY (location_id));

    CREATE TABLE suppliers (
        supplier_id INTEGER,
        supplier_name VARCHAR(50) NOT NULL,
        supplier_email VARCHAR(100) NOT NULL,
        PRIMARY KEY (supplier_id));

    CREATE TABLE customers (
        customer_id INTEGER,
        customer_first_name VARCHAR(20) NOT NULL,
        customer_last_name VARCHAR(20) NOT NULL,
        customer_email VARCHAR(100) NOT NULL,
        PRIMARY KEY (customer_id));

    CREATE TABLE main_categories (
        main_category_id INTEGER,
        main_category_name VARCHAR(120) NOT NULL,
        PRIMARY KEY (main_category_id));

    CREATE TABLE sub_categories (
        sub_category_id INTEGER,
        sub_category_name VARCHAR(120) NOT NULL,
        main_category_id INTEGER NOT NULL,
        PRIMARY KEY (sub_category_id),
        FOREIGN KEY (main_category_id) REFERENCES main_categories(main_category_id));

    CREATE TABLE employees (
        employee_id INTEGER,
        employee_first_name VARCHAR(20) NOT NULL,
        employee_last_name VARCHAR(20) NOT NULL,
        employee_email VARCHAR(100) NOT NULL,
        employee_phone VARCHAR(20) NOT NULL,
        employee_position VARCHAR(50) NOT NULL,
        hourly_wage DECIMAL(5,2) NOT NULL,
        location_id INTEGER NOT NULL,
        PRIMARY KEY (employee_id),
        FOREIGN KEY (location_id) REFERENCES locations(location_id));

    CREATE TABLE items (
        item_id INTEGER,
        item_name VARCHAR(100) NOT NULL,
        sub_category_id INTEGER NOT NULL,
        supplier_id INTEGER NOT NULL,
        purchase_price DECIMAL(4,2) NOT NULL,
        selling_price DECIMAL(4,2) NOT NULL,
        PRIMARY KEY (item_id),
        FOREIGN KEY (supplier_id) REFERENCES suppliers(supplier_id),
        FOREIGN KEY (sub_category_id) REFERENCES sub_categories(sub_category_id));
        
    CREATE TABLE shelves (
        shelf_id VARCHAR(5),
        sub_category_id INTEGER NOT NULL,
        aisle_id INTEGER NOT NULL,
        PRIMARY KEY (shelf_id),
        FOREIGN KEY (aisle_id) REFERENCES aisles(aisle_id),
        FOREIGN KEY (sub_category_id) REFERENCES sub_categories(sub_category_id));        

    CREATE TABLE inventory (
        inventory_id INTEGER,
        item_id INTEGER NOT NULL,
        location_id INTEGER NOT NULL,
        shelf_id VARCHAR(5) NOT NULL,
        quantity_in_stock INTEGER NOT NULL,
        PRIMARY KEY (inventory_id),
        FOREIGN KEY (item_id) REFERENCES items(item_id),
        FOREIGN KEY (location_id) REFERENCES locations(location_id),
        FOREIGN KEY (shelf_id) REFERENCES shelves(shelf_id));

    CREATE TABLE deliveries (
        delivery_id INTEGER,
        item_id INTEGER NOT NULL,
        supplier_id INTEGER NOT NULL,
        location_id INTEGER NOT NULL,
        delivery_date DATE NOT NULL,
        quantity_delivered INTEGER NOT NULL,
        PRIMARY KEY (delivery_id),
        FOREIGN KEY (item_id) REFERENCES items(item_id),
        FOREIGN KEY (supplier_id) REFERENCES suppliers(supplier_id),
        FOREIGN KEY (location_id) REFERENCES locations(location_id));

    CREATE TABLE sales (
        sale_id INTEGER,
        employee_id INTEGER NOT NULL,
        sale_date DATE NOT NULL,
        total_amount DECIMAL(6,2) NOT NULL,
        customer_id INTEGER NOT NULL,
        location_id INTEGER NOT NULL,
        PRIMARY KEY (sale_id),
        FOREIGN KEY (employee_id) REFERENCES employees(employee_id),
        FOREIGN KEY (location_id) REFERENCES locations(location_id),
        FOREIGN KEY (customer_id) REFERENCES customers(customer_id));

    CREATE TABLE transactions (
        transaction_id INTEGER,
        sale_id INTEGER NOT NULL,
        item_id INTEGER NOT NULL,
        quantity_sold SMALLINT NOT NULL,
        PRIMARY KEY (transaction_id),
        FOREIGN KEY (sale_id) REFERENCES sales(sale_id),
        FOREIGN KEY (item_id) REFERENCES items(item_id));

    CREATE TABLE expenses (
        expense_id INTEGER,
        location_id INTEGER NOT NULL,
        expense_date DATE NOT NULL,
        expense_description VARCHAR NOT NULL,
        expense_amount DECIMAL(8, 2) NOT NULL,
        PRIMARY KEY (expense_id),
        FOREIGN KEY (location_id) REFERENCES locations(location_id));

    CREATE TABLE employee_shifts (
        employee_shift_id INTEGER,
        employee_id INTEGER NOT NULL,
        shift_date DATE NOT NULL,
        shift_start_time TIME NOT NULL,
        shift_end_time TIME NOT NULL,
        PRIMARY KEY (employee_shift_id),
        FOREIGN KEY (employee_id) REFERENCES employees(employee_id));
"""

# Execute the statement to create tables
connection.execute(sql_statement)

# Close the connection
connection.close()

In [8]:
#Rename employee_data variables
employees = employee_data.rename(columns={'FIRST_NAME': 'employee_first_name', 'LAST_NAME': 'employee_last_name', 'EMAIL': 'employee_email', 'PHONE_NUMBER': 'employee_phone', 'JOB_ID': 'employee_position', 'SALARY': 'hourly_wage'})

In [9]:
#Filter employee_data and drop duplicates to create employees table
employees = employees[['employee_first_name','employee_last_name','employee_email','employee_phone','employee_position', 'hourly_wage']].drop_duplicates()

In [10]:
#Add in location_id to employee table
employees = employees.sort_values(by='employee_position')
random_location_ids = np.random.randint(1,7,size=len(employees))
location_id = pd.DataFrame({'location_id':random_location_ids})
employees = pd.concat([employees,location_id], axis=1)

In [11]:
#Add employee_id to employee table
employees.insert(0, 'employee_id', range(1, 1 + len(employee_data)))

In [12]:
#Change hourly_wage from monthly salary amount
employees['hourly_wage'] = round(employees['hourly_wage'] * 12 / 52 / 40, 0)

In [13]:
#Add @gmail after every email
employees['employee_email'] = employees['employee_email'] + '@gmail.com'

In [14]:
employees

,employee_id,employee_first_name,employee_last_name,employee_email,employee_phone,employee_position,hourly_wage,location_id
8,1,William,Gietz,WGIETZ@gmail.com,515.123.8181,AC_ACCOUNT,48.0,3
7,2,Shelley,Higgins,SHIGGINS@gmail.com,515.123.8080,AC_MGR,69.0,3
2,3,Jennifer,Whalen,JWHALEN@gmail.com,515.123.4444,AD_ASST,25.0,5
9,4,Steven,King,SKING@gmail.com,515.123.4567,AD_PRES,138.0,6
10,5,Neena,Kochhar,NKOCHHAR@gmail.com,515.123.4568,AD_VP,98.0,3
11,6,Lex,De Haan,LDEHAAN@gmail.com,515.123.4569,AD_VP,98.0,4
19,7,John,Chen,JCHEN@gmail.com,515.124.4269,FI_ACCOUNT,47.0,1
18,8,Daniel,Faviet,DFAVIET@gmail.com,515.124.4169,FI_ACCOUNT,52.0,3
22,9,Luis,Popp,LPOPP@gmail.com,515.124.4567,FI_ACCOUNT,40.0,5
20,10,Ismael,Sciarra,ISCIARRA@gmail.com,515.124.4369,FI_ACCOUNT,44.0,5
21,11,Jose Manuel,Urman,JMURMAN@gmail.com,515.124.4469,FI_ACCOUNT,45.0,1
17,12,Nancy,Greenberg,NGREENBE@gmail.com,515.124.4569,FI_MGR,69.0,5
5,13,Susan,Mavris,SMAVRIS@gmail.com,515.123.7777,HR_REP,38.0,6
12,14,Alexander,Hunold,AHUNOLD@gmail.com,590.423.4567,IT_PROG,52.0,4
14,15,David,Austin,DAUSTIN@gmail.com,590.423.4569,IT_PROG,28.0,4
15,16,Valli,Pataballa,VPATABAL@gmail.com,590.423.4560,IT_PROG,28.0,2
16,17,Diana,Lorentz,DLORENTZ@gmail.com,590.423.5567,IT_PROG,24.0,5
13,18,Bruce,Ernst,BERNST@gmail.com,590.423.4568,IT_PROG,35.0,5
3,19,Michael,Hartstein,MHARTSTE@gmail.com,515.123.5555,MK_MAN,75.0,5
4,20,Pat,Fay,PFAY@gmail.com,603.123.6666,MK_REP,35.0,3
6,21,Hermann,Baer,HBAER@gmail.com,515.123.8888,PR_REP,58.0,2
27,22,Guy,Himuro,GHIMURO@gmail.com,515.127.4565,PU_CLERK,15.0,6
24,23,Alexander,Khoo,AKHOO@gmail.com,515.127.4562,PU_CLERK,18.0,5
28,24,Karen,Colmenares,KCOLMENA@gmail.com,515.127.4566,PU_CLERK,14.0,1
25,25,Shelli,Baida,SBAIDA@gmail.com,515.127.4563,PU_CLERK,17.0,1
26,26,Sigal,Tobias,STOBIAS@gmail.com,515.127.4564,PU_CLERK,16.0,5
23,27,Den,Raphaely,DRAPHEAL@gmail.com,515.127.4561,PU_MAN,63.0,1
0,28,Donald,OConnell,DOCONNEL@gmail.com,650.507.9833,SH_CLERK,15.0,3
1,29,Douglas,Grant,DGRANT@gmail.com,650.507.9844,SH_CLERK,15.0,6
47,30,Stephen,Stiles,SSTILES@gmail.com,650.121.2034,ST_CLERK,18.0,2
46,31,Renske,Ladwig,RLADWIG@gmail.com,650.121.1234,ST_CLERK,21.0,4
45,32,Hazel,Philtanker,HPHILTAN@gmail.com,650.127.1634,ST_CLERK,13.0,5
44,33,Ki,Gee,KGEE@gmail.com,650.127.1734,ST_CLERK,14.0,1
43,34,Michael,Rogers,MROGERS@gmail.com,650.127.1834,ST_CLERK,17.0,6
42,35,Jason,Mallin,JMALLIN@gmail.com,650.127.1934,ST_CLERK,19.0,6
41,36,TJ,Olson,TJOLSON@gmail.com,650.124.8234,ST_CLERK,12.0,3
40,37,James,Marlow,JAMRLOW@gmail.com,650.124.7234,ST_CLERK,14.0,4
39,38,Mozhe,Atkinson,MATKINSO@gmail.com,650.124.6234,ST_CLERK,16.0,2
38,39,Laura,Bissot,LBISSOT@gmail.com,650.124.5234,ST_CLERK,19.0,3
37,40,Steven,Markle,SMARKLE@gmail.com,650.124.1434,ST_CLERK,13.0,2
36,41,James,Landry,JLANDRY@gmail.com,650.124.1334,ST_CLERK,14.0,5
35,42,Irene,Mikkilineni,IMIKKILI@gmail.com,650.124.1224,ST_CLERK,16.0,4
34,43,Julia,Nayer,JNAYER@gmail.com,650.124.1214,ST_CLERK,18.0,3
48,44,John,Seo,JSEO@gmail.com,650.121.2019,ST_CLERK,16.0,2
49,45,Joshua,Patel,JPATEL@gmail.com,650.121.1834,ST_CLERK,14.0,5
33,46,Kevin,Mourgos,KMOURGOS@gmail.com,650.123.5234,ST_MAN,33.0,4
32,47,Shanta,Vollman,SVOLLMAN@gmail.com,650.123.4234,ST_MAN,38.0,4
31,48,Payam,Kaufling,PKAUFLIN@gmail.com,650.123.3234,ST_MAN,46.0,5
30,49,Adam,Fripp,AFRIPP@gmail.com,650.123.2234,ST_MAN,47.0,2
29,50,Matthew,Weiss,MWEISS@gmail.com,650.123.1234,ST_MAN,46.0,5

In [15]:
#Filter employee_data to create employee_shifts table
employee_shifts = employees[['employee_id']]

In [16]:
#Duplicate dataset 20 times to create 20 shifts per employee
employee_shifts = pd.concat([employee_shifts] * 20, ignore_index=True)

In [17]:
#Figure out length of employees_shifts table
len(employee_shifts)

1000

In [18]:
#Function to generate random dates within November 2023
def generate_random_dates(start_date, end_date):
    start_datetime = datetime.strptime(start_date, '%Y-%m-%d')
    end_datetime = datetime.strptime(end_date, '%Y-%m-%d')

    # Calculate the range in days
    delta = (end_datetime - start_datetime).days

    # Generate random date within the range
    random_days = random.randint(0, delta)
    random_date = start_datetime + timedelta(days=random_days)

    return random_date.date()

#Define the range for job shifts
start_shift_date_range = '2023-11-01'  # Start date
end_shift_date_range = '2023-11-30'  # End date

random_shift_date = [generate_random_dates(start_shift_date_range, end_shift_date_range) for x in range(1000)]

df_shift_date = pd.DataFrame({'shift_date': random_shift_date})
df_shift_date

     shift_date
0    2023-11-02
1    2023-11-15
2    2023-11-06
3    2023-11-24
4    2023-11-10
..          ...
995  2023-11-06
996  2023-11-19
997  2023-11-18
998  2023-11-20
999  2023-11-16

[1000 rows x 1 columns]

In [19]:
# Function to generate random shift start times
def generate_shift_start_times(num_times):
    shift_start_times = []
    for _ in range(num_times):
        hour = random.randint(0, 23)  # Generate random hour (0-23)
        minute = random.randint(0, 59)  # Generate random minute (0-59)
        shift_start_times.append(f"{hour:02}:{minute:02}")

    return shift_start_times

# Number of shift start times to generate
num_shifts = 1000

# Generate random shift start times
shift_start_times = generate_shift_start_times(num_shifts)

# Create a DataFrame to store shift start times
df_start_shifts = pd.DataFrame({'shift_start_time': shift_start_times})

# Display the DataFrame
print(df_start_shifts)

    shift_start_time
0              18:39
1              09:10
2              18:17
3              22:37
4              09:37
..               ...
995            03:21
996            22:05
997            11:46
998            21:26
999            11:29

[1000 rows x 1 columns]

In [20]:
#Add shift_date, shift_start_time, & shift_end_time
employee_shifts = pd.concat([employee_shifts, df_shift_date], axis=1)
employee_shifts = pd.concat([employee_shifts, df_start_shifts], axis=1)
employee_shifts['shift_start_time'] = pd.to_datetime(employee_shifts['shift_start_time'])
employee_shifts['shift_end_time'] = employee_shifts['shift_start_time'] + pd.to_timedelta('8 hours')

In [21]:
#Change datatypes for shifts
employee_shifts['shift_start_time'] = employee_shifts['shift_start_time'].dt.strftime('%H:%M:%S')
employee_shifts['shift_end_time'] = employee_shifts['shift_end_time'].dt.strftime('%H:%M:%S')

In [22]:
#Add employee_id to employee_shifts table
employee_shifts.insert(0, 'employee_shift_id', range(1, 1 + len(employee_shifts)))

In [23]:
employee_shifts

,employee_shift_id,employee_id,shift_date,shift_start_time,shift_end_time
0,1,1,2023-11-02,18:39:00,02:39:00
1,2,2,2023-11-15,09:10:00,17:10:00
2,3,3,2023-11-06,18:17:00,02:17:00
3,4,4,2023-11-24,22:37:00,06:37:00
4,5,5,2023-11-10,09:37:00,17:37:00
...,...,...,...,...,...
995,996,46,2023-11-06,03:21:00,11:21:00
996,997,47,2023-11-19,22:05:00,06:05:00
997,998,48,2023-11-18,11:46:00,19:46:00
998,999,49,2023-11-20,21:26:00,05:26:00
999,1000,50,2023-11-16,11:29:00,19:29:00

In [24]:
#Rename employee_data variables
locations = location_data.rename(columns={'Street Address': 'location_address', 'Borough': 'location_borough', 'Zip Code': 'location_zip_code'})

In [25]:
#Filter location_data to create locations table
locations = locations[['location_address', 'location_borough', 'location_zip_code']].drop_duplicates()

In [26]:
#Add locaton_city & location_state
locations = locations.assign(location_city='New York City')
locations = locations.assign(location_state='New York')

In [27]:
#Select 2 locations with borough Bronx, Brooklyn, & New York
locations = locations.groupby('location_borough').head(2)

In [28]:
#Add location_id to location table
locations.insert(0, 'location_id', range(1, 1 + len(locations)))

In [29]:
locations

,location_id,location_address,location_borough,location_zip_code,location_city,location_state
0,1,651 East 183rd Street,Bronx,10458,New York City,New York
1,2,1761 Southern Boulevard,Bronx,10460,New York City,New York
71,3,3368 Fulton Street,Brooklyn,11208,New York City,New York
72,4,1203 Sutter Avenue,Brooklyn,11208,New York City,New York
121,5,1626 Park Avenue,New York,10029,New York City,New York
122,6,1858 Lexington Avenue,New York,10029,New York City,New York

In [30]:
#Rename expenses variables
expenses = expense_data.rename(columns={'Category': 'expense_description', 'Amount': 'expense_amount'})

In [31]:
#Replace values in expense_description to match supermarket expenses
original_replace_dict = {
    'Self-development': 'License And Permits',
    'Education': 'Other',
    'Social Life': 'Security',
    'Apparel': 'Technology',
    'Salary': 'Insurance',
    'Transportation': 'Supplies',
    'Household': 'Utilities',
    'Allowance': 'Rent',
    'Food': 'Repairs',
    'Other': 'Marketing'
}
expenses['expense_description'].replace(original_replace_dict, inplace=True)

In [32]:
#Filter location_data to create locations table
expenses = expenses[['expense_description', 'expense_amount']].drop_duplicates()

In [33]:
#Add location_id to locations table
random_location_ids = np.random.randint(1,7,size=len(expenses))
location_id = pd.DataFrame({'location_id':random_location_ids})
expenses = pd.concat([expenses, location_id], axis=1)

In [34]:
# Function to generate random dates within November 2023
def generate_random_dates(start_date, end_date):
    start_datetime = datetime.strptime(start_date, '%Y-%m-%d')
    end_datetime = datetime.strptime(end_date, '%Y-%m-%d')

    # Calculate the range in days
    delta = (end_datetime - start_datetime).days

    # Generate random date within the range
    random_days = random.randint(0, delta)
    random_date = start_datetime + timedelta(days=random_days)

    return random_date.date()

# Define the range for job shifts
start_shift_date_range = '2023-11-01'  # Start date
end_shift_date_range = '2023-11-30'  # End date

random_shift_date = [generate_random_dates(start_shift_date_range, end_shift_date_range) for x in range(171)]

expense_date = pd.DataFrame({'expense_date': random_shift_date})
expense_date

    expense_date
0     2023-11-19
1     2023-11-12
2     2023-11-27
3     2023-11-30
4     2023-11-03
..           ...
166   2023-11-08
167   2023-11-02
168   2023-11-16
169   2023-11-16
170   2023-11-22

[171 rows x 1 columns]

In [35]:
#Add expense_date to expenses table
expenses = pd.concat([expenses, expense_date], axis=1)

In [36]:
#Add expense_id to expenses table
expenses.insert(0, 'expense_id', range(1, 1 + len(expenses)))

In [37]:
#Filter employee_data and drop duplicates to create employees table
expenses = expenses[['expense_id', 'expense_description', 'expense_amount', 'location_id', 'expense_date']].dropna()

In [38]:
expenses

     expense_id  expense_description  expense_amount  location_id expense_date
0             1              Repairs            50.0          6.0   2023-11-19
1             2            Marketing           300.0          2.0   2023-11-12
2             3              Repairs            78.0          3.0   2023-11-27
3             4             Supplies            30.0          4.0   2023-11-30
4             5              Repairs            67.0          4.0   2023-11-03
..          ...                  ...             ...          ...          ...
161         123             Supplies           286.0          2.0   2023-11-21
163         124              Repairs            14.0          5.0   2023-11-11
168         125              Repairs           504.0          2.0   2023-11-16
169         126             Supplies           306.0          5.0   2023-11-16
170         127  License And Permits           400.0          3.0   2023-11-22

[127 rows x 5 columns]

In [39]:
#check length of items_data before filtering
items_data['company'].nunique()

329

In [40]:
#filter suppliers to become a more reasonable number but still keep all categories
grouped_data = items_data.groupby(['category', 'company']).size().reset_index(name='count')
grouped_data = grouped_data.sort_values(['category', 'count'], ascending=[True, False])
top_10_companies_per_category = grouped_data.groupby('category').head(10)
items_data = pd.merge(items_data, top_10_companies_per_category, on=['category', 'company'], how='inner')

In [41]:
#check length of items_data after filtering
items_data['company'].nunique()

99

In [42]:
#Rename suppliers variables
items_data['company'] = items_data['company'].replace('Whole Foods Market', "ABC Food Mart")
suppliers = items_data.rename(columns={'company': 'supplier_name'})

In [43]:
#Filter to create suppliers table
suppliers = suppliers [['supplier_name']].drop_duplicates()

In [44]:
#Create supplier_email
suppliers['supplier_email'] = ('logistics@' + suppliers['supplier_name'].str.replace(' ', '') + '.com').str.lower()

In [45]:
#Add supplier_id to supplier table
suppliers.insert(0, 'supplier_id', range(1, 1 + len(suppliers)))

In [46]:
suppliers

      supplier_id           supplier_name                      supplier_email
0               1              MAD HIPPIE             logistics@madhippie.com
7               2            Ocean's Halo           logistics@ocean'shalo.com
19              3  Jason Natural Products  logistics@jasonnaturalproducts.com
24              4       Annie's Homegrown      logistics@annie'shomegrown.com
45              5              AURA CACIA             logistics@auracacia.com
...           ...                     ...                                 ...
998            95            Bell & Evans            logistics@bell&evans.com
1000           96                 SEAFOOD               logistics@seafood.com
1004           97                  FLORAL                logistics@floral.com
1005           98                  Mitica                logistics@mitica.com
1009           99        Enjoy Life Foods        logistics@enjoylifefoods.com

[99 rows x 3 columns]

In [47]:
#Create aisles table
aisles = {
    'aisle_name': ['Storage', 'Refrigerated and Frozen', 'Convenience and Snack', 'Produce and Bakery', 'Health and Beauty'],
    'aisle_id': [0, 1, 2, 3, 4]
}

In [48]:
#Transform aisles into dataframe
aisles = pd.DataFrame(aisles)

In [49]:
aisles

                aisle_name  aisle_id
0                  Storage         0
1  Refrigerated and Frozen         1
2    Convenience and Snack         2
3       Produce and Bakery         3
4        Health and Beauty         4

In [50]:
#Filter to create categories table
categories = items_data[['parsed_product' , 'category']].drop_duplicates()

In [51]:
#rename and reorder categories
categories = categories.rename(columns={'category': 'main_category_name' , 'parsed_product': 'sub_category_name' })
categories = categories[['main_category_name', 'sub_category_name']]
categories['main_category_name'] = categories['main_category_name'].str.title().str.replace('_', ' ')

In [52]:
#Add category_id to category table
categories.insert(0, 'category_id', range(1, 1 + len(categories)))

In [53]:
#Filter to create shelves table
shelves = items_data[['parsed_product' , 'category']].drop_duplicates()

In [54]:
#add aisle_id to shelves
category_mapping = {
    'meat': 1, 'Beverages': 1, 'bread_rolls_bakery': 1, 'supplements': 1,
    'seafood': 2, 'prepared_foods': 2, 'desserts': 2, 'beauty': 2,
    'frozen_foods': 3, 'snacks_chips_salsas_dips': 3, 'floral': 3, 'body_care': 3,
    'dairy_eggs': 4, 'pantry_essentials': 4, 'produce': 4, 'lifestyle': 4
}

shelves['aisle_id'] = shelves['category'].replace(category_mapping, regex=True)

In [55]:
#add shelf_id to shleves
shelves['shelf_id'] = shelves['aisle_id'].astype(str) + '_' + (shelves.groupby('aisle_id').cumcount() + 1).astype(str)

In [56]:
#Add category_id to shevles
shelves['category'] = shelves['category'].str.title().str.replace('_', ' ')
shelves = pd.merge(shelves, categories, 
                     left_on=['category', 'parsed_product'], 
                     right_on=['main_category_name', 'sub_category_name'], 
                     how='left')

In [57]:
#rename and reorder shleves
shelves = shelves.rename(columns={'category_id': 'sub_category_id'})
shelves = shelves.drop(['main_category_name', 'sub_category_name', 'category' , 'parsed_product'], axis=1)
shelves = shelves[['shelf_id', 'sub_category_id', 'aisle_id']]

In [58]:
#Add storage row
new_row = pd.DataFrame({'shelf_id': [0], 'sub_category_id': [0], 'aisle_id': [0]})
shelves = pd.concat([new_row, shelves], ignore_index=True)

In [59]:
shelves

    shelf_id  sub_category_id  aisle_id
0          0                0         0
1        2_1                1         2
2        2_2                2         2
3        2_3                3         2
4        2_4                4         2
..       ...              ...       ...
237     2_33              237         2
238     2_34              238         2
239     1_49              239         1
240     2_35              240         2
241     2_36              241         2

[242 rows x 3 columns]

In [60]:
#Filter to create items table
items = items_data[['company', 'product', 'category', 'regular' , 'prime' , 'parsed_product']]
items.loc[:, 'category'] = items ['category'].str.title().str.replace('_', ' ')

C:\Users\jason\AppData\Local\Temp\ipykernel_28352\2662924650.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  items.loc[:, 'category'] = items ['category'].str.title().str.replace('_', ' ')

In [61]:
#add category_id
items = pd.merge(items, categories, how='left', left_on=['category', 'parsed_product'], right_on=['main_category_name', 'sub_category_name'])
items = items.drop(['main_category_name', 'sub_category_name', 'category', 'parsed_product'], axis=1)

In [62]:
items = pd.merge(items, suppliers[['supplier_name', 'supplier_id']], how='left', left_on='company', right_on='supplier_name')
items = items.drop(['supplier_name', 'company'], axis=1)

In [63]:
#Add item_id
items.insert(0, 'item_id', range(1, 1 + len(items)))

In [64]:
#rename and reorder items table
items = items.rename(columns={'product' : 'item_name', 'regular' : 'selling_price' , 'prime' : 'purchase_price', 'category_id': 'sub_category_id'})
items = items[['item_id', 'item_name', 'sub_category_id', 'supplier_id', 'purchase_price', 'selling_price']]

In [65]:
items

,item_id,item_name,sub_category_id,supplier_id,purchase_price,selling_price
0,1,Antioxidant Facial Oil,1,1,13.04,25.99
1,2,Mad Hip Eye Cream,2,1,19.79,25.99
2,3,Vitamin A Serum,3,1,25.19,32.99
3,4,Mad Hip Vitamin C Serum,3,1,27.89,36.49
4,5,Face Cream,2,1,20.69,26.99
...,...,...,...,...,...,...
1005,1006,Rosemary Toketti Di Pane Carasau Crackers,239,98,5.17,6.99
1006,1007,Cinnamon Roll Blondie,240,91,1.50,1.99
1007,1008,Chocolate Filled Crepes 6 Pack,241,17,4.04,4.99
1008,1009,Traditional Crepes 10 Count,240,17,4.94,5.99
1009,1010,Mini Chocolate Chip Soft Cookies 6 Pack,117,99,3.59,4.19

In [66]:
#Filter to create main_categories table
main_categories = categories[['main_category_name']].drop_duplicates()

In [67]:
#Add main_category_id
main_categories.insert(0, 'main_category_id', range(1, 1 + len(main_categories)))

In [68]:
#Add storage row
new_row = pd.DataFrame({'main_category_id': [0], 'main_category_name': 'Storage'})
main_categories = pd.concat([new_row, main_categories], ignore_index=True)

In [69]:
main_categories

    main_category_id        main_category_name
0                  0                   Storage
1                  1                    Beauty
2                  2         Pantry Essentials
3                  3                 Body Care
4                  4                 Beverages
5                  5                Dairy Eggs
6                  6              Frozen Foods
7                  7  Snacks Chips Salsas Dips
8                  8               Supplements
9                  9                   Produce
10                10                      Meat
11                11            Prepared Foods
12                12                   Seafood
13                13        Bread Rolls Bakery
14                14                 Lifestyle
15                15                    Floral
16                16                  Desserts

In [70]:
#Add main_category_id to sub_categories table
sub_categories = categories
sub_categories = sub_categories.merge(main_categories, how='left', left_on='main_category_name', right_on='main_category_name')
sub_categories = sub_categories.drop(['main_category_name'], axis=1)

In [71]:
#Rename sub_categories table
sub_categories = sub_categories.rename(columns={'category_id': 'sub_category_id'})

In [72]:
#Add storage row
new_row = pd.DataFrame({'sub_category_id': [0], 'sub_category_name': 'Storage', 'main_category_id': [0]})
sub_categories = pd.concat([new_row, sub_categories], ignore_index=True)

In [73]:
sub_categories

     sub_category_id sub_category_name  main_category_id
0                  0           Storage                 0
1                  1               Oil                 1
2                  2             Cream                 1
3                  3             Serum                 1
4                  4          Cleanser                 1
..               ...               ...               ...
237              237           Tilapia                12
238              238            Fillet                12
239              239          Crackers                13
240              240           Dessert                16
241              241         Chocolate                16

[242 rows x 3 columns]

In [74]:
#Filter to create inventory table
inventory = items[['item_id', 'sub_category_id']]

In [75]:
#Duplicate inventory table 6 times to create 6 locations per item
inventory = pd.concat([inventory] * 6, ignore_index=True)

In [76]:
#Add location_id for every item_id, each item should be in all 6 locations
inventory['location_id'] = inventory.groupby('item_id').cumcount() + 1

In [77]:
#Add category_id to inventory table
inventory = pd.merge(inventory, shelves, left_on=['sub_category_id'], right_on=['sub_category_id'], how='left')
inventory = inventory.drop(['aisle_id', 'sub_category_id'], axis=1)

In [78]:
#create a temp_inventory table for storage shelf_id
temp_inventory = inventory.copy()
temp_inventory['shelf_id'] = 0

In [79]:
#Combine temp_inventory with inventory
inventory = pd.concat([inventory, temp_inventory], ignore_index=True)

In [80]:
#Add quantity_in_stock to inventory table
inventory['quantity_in_stock'] = inventory.apply(lambda row: np.random.randint(0, 51) if row['shelf_id'] == 0 else np.random.randint(0, 11), axis=1)

In [81]:
#Add inventory_id to inventory
inventory.insert(0, 'inventory_id', range(1, 1 + len(inventory)))

In [82]:
inventory

       inventory_id  item_id  location_id shelf_id  quantity_in_stock
0                 1        1            1      2_1                  7
1                 2        2            1      2_2                  0
2                 3        3            1      2_3                  0
3                 4        4            1      2_3                  1
4                 5        5            1      2_2                  1
...             ...      ...          ...      ...                ...
12115         12116     1006            6        0                 25
12116         12117     1007            6        0                  7
12117         12118     1008            6        0                 26
12118         12119     1009            6        0                 20
12119         12120     1010            6        0                 12

[12120 rows x 5 columns]

In [83]:
#Filter to create deliveries table
deliveries = items[['item_id', 'supplier_id']]

In [84]:
#Figure out length of deliveries table
len(deliveries)

1010

In [85]:
# Function to generate random dates within November 2023
def generate_random_dates(start_date, end_date):
    start_datetime = datetime.strptime(start_date, '%Y-%m-%d')
    end_datetime = datetime.strptime(end_date, '%Y-%m-%d')

    # Calculate the range in days
    delta = (end_datetime - start_datetime).days

    # Generate random date within the range
    random_days = random.randint(0, delta)
    random_date = start_datetime + timedelta(days=random_days)

    return random_date.date()

# Define the range for job shifts
start_shift_date_range = '2023-11-01'  # Start date
end_shift_date_range = '2023-11-30'  # End date

random_shift_date = [generate_random_dates(start_shift_date_range, end_shift_date_range) for x in range(1010)]

delivery_date = pd.DataFrame({'delivery_date': random_shift_date})
delivery_date

     delivery_date
0       2023-11-11
1       2023-11-09
2       2023-11-14
3       2023-11-23
4       2023-11-15
...            ...
1005    2023-11-22
1006    2023-11-19
1007    2023-11-09
1008    2023-11-30
1009    2023-11-12

[1010 rows x 1 columns]

In [86]:
#Add delivery_date to deliveries table
deliveries = pd.concat([deliveries, delivery_date], axis=1)

In [87]:
#Add quantity_delivered to deliveries table
temp_deliveries = pd.DataFrame({'some_column': range(1010)}) 
deliveries['quantity_delivered'] = (temp_deliveries.index % 6) * 10
deliveries = deliveries.loc[deliveries['quantity_delivered'] != 0]

In [88]:
#Add location_id to deliveries table
deliveries['location_id'] = np.random.randint(1, 7, size=len(deliveries))

In [89]:
#Add delivery_id to inventory
deliveries.insert(0, 'delivery_id', range(1, 1 + len(deliveries)))

In [90]:
#reorder deliveries table
deliveries = deliveries[['delivery_id', 'item_id', 'supplier_id', 'location_id', 'delivery_date', 'quantity_delivered']]

In [91]:
deliveries

,delivery_id,item_id,supplier_id,location_id,delivery_date,quantity_delivered
1,1,2,1,3,2023-11-09,10
2,2,3,1,6,2023-11-14,20
3,3,4,1,6,2023-11-23,30
4,4,5,1,3,2023-11-15,40
5,5,6,1,2,2023-11-27,50
...,...,...,...,...,...,...
1004,837,1005,97,6,2023-11-23,20
1005,838,1006,98,2,2023-11-22,30
1006,839,1007,91,4,2023-11-19,40
1007,840,1008,17,4,2023-11-09,50
1009,841,1010,99,6,2023-11-12,10

In [92]:
#Filter to create customers table
customers = employee_data[['FIRST_NAME', 'LAST_NAME']]

In [93]:
#rename customers table
customers = customers.rename(columns={'FIRST_NAME' : 'customer_first_name', 'LAST_NAME' : 'customer_last_name'})

In [94]:
#Randomize customer names
customers['customer_first_name'] = np.random.permutation(customers['customer_first_name'])
customers['customer_last_name'] = np.random.permutation(customers['customer_last_name'])
customers1 = customers.copy()
customers1['customer_first_name'] = np.random.permutation(customers1['customer_first_name'])
customers1['customer_last_name'] = np.random.permutation(customers1['customer_last_name'])
customers2 = customers1.copy()
customers2['customer_first_name'] = np.random.permutation(customers2['customer_first_name'])
customers2['customer_last_name'] = np.random.permutation(customers2['customer_last_name'])
customers3 = customers2.copy()
customers3['customer_first_name'] = np.random.permutation(customers3['customer_first_name'])
customers3['customer_last_name'] = np.random.permutation(customers3['customer_last_name'])
customers4 = customers3.copy()
customers4['customer_first_name'] = np.random.permutation(customers4['customer_first_name'])
customers4['customer_last_name'] = np.random.permutation(customers4['customer_last_name'])
customers5 = customers4.copy()
customers5['customer_first_name'] = np.random.permutation(customers5['customer_first_name'])
customers5['customer_last_name'] = np.random.permutation(customers5['customer_last_name'])
customers6 = customers5.copy()
customers6['customer_first_name'] = np.random.permutation(customers6['customer_first_name'])
customers6['customer_last_name'] = np.random.permutation(customers6['customer_last_name'])
customers7 = customers6.copy()
customers7['customer_first_name'] = np.random.permutation(customers7['customer_first_name'])
customers7['customer_last_name'] = np.random.permutation(customers7['customer_last_name'])
customers8 = customers7.copy()
customers8['customer_first_name'] = np.random.permutation(customers8['customer_first_name'])
customers8['customer_last_name'] = np.random.permutation(customers8['customer_last_name'])
customers9 = customers8.copy()
customers9['customer_first_name'] = np.random.permutation(customers9['customer_first_name'])
customers9['customer_last_name'] = np.random.permutation(customers9['customer_last_name'])

In [95]:
#Combine random customer names
customers = pd.concat([customers, customers1, customers2, customers3, customers4, customers5, customers6, customers7, customers8, customers9], ignore_index=True)

In [96]:
#Create customer_email
customers['customer_email'] = (customers['customer_first_name'] + customers['customer_last_name'] + '@gmail.com').str.lower()

In [97]:
#Add customer_id to inventory
customers.insert(0, 'customer_id', range(1, 1 + len(customers)))

In [98]:
customers

,customer_id,customer_first_name,customer_last_name,customer_email
0,1,Valli,Ladwig,valliladwig@gmail.com
1,2,Joshua,Whalen,joshuawhalen@gmail.com
2,3,John,Greenberg,johngreenberg@gmail.com
3,4,Lex,King,lexking@gmail.com
4,5,Jose Manuel,Weiss,jose manuelweiss@gmail.com
...,...,...,...,...
495,496,Shanta,Lorentz,shantalorentz@gmail.com
496,497,John,King,johnking@gmail.com
497,498,Douglas,Kaufling,douglaskaufling@gmail.com
498,499,Guy,Fripp,guyfripp@gmail.com
499,500,Steven,Weiss,stevenweiss@gmail.com

In [99]:
#filter to create sales table
sales = employees[['employee_position', 'location_id', 'employee_id']]

In [100]:
#filter sales table for certain employees
sales = sales[sales['employee_position'].isin(['ST_CLERK', 'ST_MAN', 'SH_CLERK'])]

In [101]:
#Duplicate dataset 200 times to create additional sales
sales = pd.concat([sales] * 100, ignore_index=True)

In [102]:
#Remove employee_position
sales = sales.drop(['employee_position'], axis=1)

In [103]:
len(sales)

2300

In [104]:
# Function to generate random dates within November 2023
def generate_random_dates(start_date, end_date):
    start_datetime = datetime.strptime(start_date, '%Y-%m-%d')
    end_datetime = datetime.strptime(end_date, '%Y-%m-%d')

    # Calculate the range in days
    delta = (end_datetime - start_datetime).days

    # Generate random date within the range
    random_days = random.randint(0, delta)
    random_date = start_datetime + timedelta(days=random_days)

    return random_date.date()

# Define the range for job shifts
start_shift_date_range = '2023-11-01'  # Start date
end_shift_date_range = '2023-11-30'  # End date

random_shift_date = [generate_random_dates(start_shift_date_range, end_shift_date_range) for x in range(2300)]

sale_date = pd.DataFrame({'sale_date': random_shift_date})
sale_date

       sale_date
0     2023-11-29
1     2023-11-29
2     2023-11-21
3     2023-11-09
4     2023-11-15
...          ...
2295  2023-11-04
2296  2023-11-10
2297  2023-11-06
2298  2023-11-03
2299  2023-11-26

[2300 rows x 1 columns]

In [105]:
#Add sale_date to sales table
sales = pd.concat([sales, sale_date], axis=1)

In [106]:
#Add customer_id to sales table
customer_ids = np.random.choice(range(1, 501), size=sales.shape[0])

# Ensure no customer_id appears more than 10 times
while any(pd.Series(customer_ids).value_counts() > 10):
    # Identify customer_ids that appear more than 10 times
    exceed_limit_ids = pd.Series(customer_ids).value_counts()[pd.Series(customer_ids).value_counts() > 10].index

    # Replace the exceed_limit_ids with new random values
    mask = np.isin(customer_ids, exceed_limit_ids)
    customer_ids[mask] = np.random.choice(range(1, 501), size=mask.sum())

# Add the customer_id column to the DataFrame
sales['customer_id'] = customer_ids

In [107]:
#Add sale_id to sales table
sales.insert(0, 'sale_id', range(1, 1 + len(sales)))

In [108]:
#Create sale_id in transactions table
unique_sale_ids = pd.DataFrame({'sale_id': np.arange(1, 2301)})

# Merge unique_sale_ids with random multipliers
merged_df = pd.merge(unique_sale_ids, pd.DataFrame({'multiplier': np.random.randint(1, 26, size=2300)}), left_index=True, right_index=True)

# Duplicate rows based on the 'multiplier' column
transactions = merged_df.loc[merged_df.index.repeat(merged_df['multiplier'])]

# Reset index to create a new sequential index
transactions.reset_index(drop=True, inplace=True)

# Drop the 'multiplier' column if you don't need it anymore
transactions.drop(columns=['multiplier'], inplace=True)

In [109]:
#Add item_id to transactions table
item_id = np.random.randint(1, 1011, size=len(transactions))
item_id = pd.DataFrame({'item_id':item_id})
transactions = pd.concat([transactions, item_id], axis=1)

In [110]:
#Add quantity_sold to transactions table
quantity_sold = np.random.randint(1, 3, size=len(transactions))
quantity_sold = pd.DataFrame({'quantity_sold':quantity_sold})
transactions = pd.concat([transactions, quantity_sold], axis=1)

In [111]:
#Add transaction_id to transactions
transactions.insert(0, 'transaction_id', range(1, 1 + len(transactions)))

In [112]:
#Create total_amount in sales table
# Step 1: Merge transactions with items using item_id
merged_df = pd.merge(transactions, items[['item_id', 'selling_price']], on='item_id', how='left')

# Step 2: Calculate total_amount by multiplying selling_price and quantity_sold
merged_df['total_amount'] = merged_df['selling_price'] * merged_df['quantity_sold']

# Step 3: Group by sale_id, sum total_amount for each sale_id
total_amount_per_sale = merged_df.groupby('sale_id')['total_amount'].sum().reset_index()

# Step 4: Merge total_amount_per_sale with sales using sale_id
sales = pd.merge(sales, total_amount_per_sale, on='sale_id', how='left')

In [113]:
transactions

       transaction_id  sale_id  item_id  quantity_sold
0                   1        1      857              2
1                   2        1      199              1
2                   3        1      900              2
3                   4        1      238              1
4                   5        1      445              1
...               ...      ...      ...            ...
29653           29654     2299      738              2
29654           29655     2299      254              1
29655           29656     2300      561              2
29656           29657     2300      306              1
29657           29658     2300      303              2

[29658 rows x 4 columns]

In [114]:
sales

      sale_id  location_id  employee_id   sale_date  customer_id  total_amount
0           1            3           28  2023-11-29          320         57.23
1           2            6           29  2023-11-29          464          3.58
2           3            2           30  2023-11-21          124        122.93
3           4            4           31  2023-11-09           35         48.76
4           5            5           32  2023-11-15          278        270.15
...       ...          ...          ...         ...          ...           ...
2295     2296            4           46  2023-11-04          240        179.95
2296     2297            4           47  2023-11-10          464          4.58
2297     2298            5           48  2023-11-06            6         61.21
2298     2299            2           49  2023-11-03          333        135.76
2299     2300            5           50  2023-11-26          328         25.95

[2300 rows x 6 columns]

In [115]:
sales['total_amount'].sum()

384593.91000000003

In [116]:
#Add dataframes to SQL 
aisles.to_sql(name='aisles', con=engine, if_exists='append', index=False)

5

In [117]:
locations.to_sql(name='locations', con=engine, if_exists='append', index=False)

6

In [118]:
suppliers.to_sql(name='suppliers', con=engine, if_exists='append', index=False)

99

In [119]:
customers.to_sql(name='customers', con=engine, if_exists='append', index=False)

500

In [120]:
main_categories.to_sql(name='main_categories', con=engine, if_exists='append', index=False)

17

In [121]:
sub_categories.to_sql(name='sub_categories', con=engine, if_exists='append', index=False)

242

In [122]:
employees.to_sql(name='employees', con=engine, if_exists='append', index=False)

50

In [123]:
items.to_sql(name='items', con=engine, if_exists='append', index=False)

10

In [124]:
shelves.to_sql(name='shelves', con=engine, if_exists='append', index=False)

242

In [125]:
inventory.to_sql(name='inventory', con=engine, if_exists='append', index=False)

120

In [126]:
deliveries.to_sql(name='deliveries', con=engine, if_exists='append', index=False)

841

In [127]:
sales.to_sql(name='sales', con=engine, if_exists='append', index=False)

300

In [128]:
transactions.to_sql(name='transactions', con=engine, if_exists='append', index=False)

658

In [129]:
expenses.to_sql(name='expenses', con=engine, if_exists='append', index=False)

127

In [130]:
employee_shifts.to_sql(name='employee_shifts', con=engine, if_exists='append', index=False)

1000